dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH4_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH4_OFF (4u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH5_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH5_OFF (5u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH6_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH6_OFF (6u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH7_OFF (7u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH0_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH0_OFF (16u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH1_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH1_OFF (17u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH2_OFF (18u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH3_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH3_OFF (19u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH4_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH4_OFF (20u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH5_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH5_OFF (21u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH6_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH6_OFF (22u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_OFF (23u)

/** \brief Length for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_LEN (8u)

/** \brief Mask for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_MSK (0xffu)

/** \brief Offset for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_OFF (0u)

/** \brief Length for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_LEN (8u)

/** \brief Mask for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_MSK (0xffu)

/** \brief Offset for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_OFF (8u)

/** \brief Length for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_LEN (16u)

/** \brief Mask for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_LEN (16u)

/** \brief Mask for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_OFF (16u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_OFF (8u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_OFF (16u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_OFF (24u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_MSK (0x3u)

