dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS6_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS7_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH6_IRQ_LEN (1u)

