dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_LEN (1u)

