dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M1_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_SPE_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_SPE_SPE5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH0_IRQ_OFF (0u)

