dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_DCHG */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_DCHG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_DCHG */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_DCHG_OFF (1u)

/** \brief Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_OFF (2u)

/** \brief Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_OFF (3u)

/** \brief Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_OFF (4u)

/** \brief Length for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_OFF (4u)

/** \brief Length for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_LEN (24u)

/** \brief Mask for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_LEN (24u)

/** \brief Mask for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_CTRL_STAT2_Bits.SPE_PAT_PTR_BWD */
#define IFX_GTM_SPE_CTRL_STAT2_SPE_PAT_PTR_BWD_LEN (3u)

/** \brief Mask for Ifx_GTM_SPE_CTRL_STAT2_Bits.SPE_PAT_PTR_BWD */
#define IFX_GTM_SPE_CTRL_STAT2_SPE_PAT_PTR_BWD_MSK (0x7u)

/** \brief Offset for Ifx_GTM_SPE_CTRL_STAT2_Bits.SPE_PAT_PTR_BWD */
#define IFX_GTM_SPE_CTRL_STAT2_SPE_PAT_PTR_BWD_OFF (8u)

/** \brief Length for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_LEN (2u)

/** \brief Mask for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_MSK (0x3u)

/** \brief Offset for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_CMD_Bits.SPE_UPD_TRIG */
#define IFX_GTM_SPE_CMD_SPE_UPD_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_CMD_Bits.SPE_UPD_TRIG */
#define IFX_GTM_SPE_CMD_SPE_UPD_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_CMD_Bits.SPE_UPD_TRIG */
#define IFX_GTM_SPE_CMD_SPE_UPD_TRIG_OFF (16u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_OFF (0u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_LEN (3u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_MSK (0x7u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_OFF (1u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_OFF (4u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_OFF (16u)

