dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_TOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_TOM_CH_SR0_SR0_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_TOM_CH_SR0_SR0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH_SR1_SR1_LEN (16u)

/** \brief Mask for Ifx_GTM_TOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH_SR1_SR1_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_TOM_CH_SR1_SR1_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_LEN (16u)

/** \brief Mask for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_TOM_CH_CM0_CM0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_LEN (16u)

/** \brief Mask for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_TOM_CH_CM1_CM1_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH_CN0_CN0_LEN (16u)

/** \brief Mask for Ifx_GTM_TOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH_CN0_CN0_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_TOM_CH_CN0_CN0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU0TC_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU0TC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU0TC_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU1TC_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU1TC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_TOM_CH_IRQ_NOTIFY_CCU1TC_OFF (1u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU0TC_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU0TC_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU0TC_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU1TC_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU1TC_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_TOM_CH_IRQ_EN_CCU1TC_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU0TC0_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU0TC0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU0TC0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU1TC0_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU1TC0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC0 */
#define IFX_GTM_TOM_CH_IRQ_FORCINT_TRG_CCU1TC0_OFF (1u)

/** \brief Length for Ifx_GTM_TOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TOM_CH_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC_GLB_CTRL_HOST_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC_GLB_CTRL_HOST_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC_GLB_CTRL_HOST_TRIG_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH0_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH0_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH1_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH1_OFF (9u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH2_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH3_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH3_OFF (11u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH4_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH4_MSK (0x1u)

