dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH4_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH5_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH5_OFF (13u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH6_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH6_OFF (14u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_RST_CH7_OFF (15u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL0_OFF (16u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL1_OFF (18u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL2_OFF (20u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL3_OFF (22u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL4_OFF (24u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL5_OFF (26u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL6_OFF (28u)

/** \brief Length for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC_GLB_CTRL_UPEN_CTRL7_OFF (30u)

/** \brief Length for Ifx_GTM_TOM_TGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC_ACT_TB_ACT_TB_LEN (24u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC_ACT_TB_ACT_TB_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TOM_TGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC_ACT_TB_ACT_TB_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC_ACT_TB_TB_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC_ACT_TB_TB_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC_ACT_TB_TB_TRIG_OFF (24u)

/** \brief Length for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC_ACT_TB_TBU_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC_ACT_TB_TBU_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC_ACT_TB_TBU_SEL_OFF (25u)

/** \brief Length for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_FUPD_CTRL2_OFF (4u)

