dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_PSM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_MSK (0x3ffu)

