dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_STATUS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_STATUS_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_OLD_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_OLD_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_OLD_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_LEN (3u)

/** \brief Mask for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_MSK (0x7u)

/** \brief Offset for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_LEN (3u)

/** \brief Mask for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_MSK (0x7u)

/** \brief Offset for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_LEN (1u)

