dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_OFF (21u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_OFF (22u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_OFF (23u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_OFF (24u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_OFF (25u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_OFF (26u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_OFF (27u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_OFF (28u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_OFF (29u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_3_SR_OFF (30u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_OFF (31u)

/** \brief Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_LEN (10u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_OFF (18u)

/** \brief Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_OFF (20u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_LEN (10u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_LEN (10u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_OFF (0u)

